In [1]:
import numpy as np
import pandas as pd
pd.set_option('display.width', 1000)

In [2]:
data_science = ['Python', 'R', 'Big Data', 'Machine Learning']
df = pd.DataFrame(data_science)
print(df)

                  0
0            Python
1                 R
2          Big Data
3  Machine Learning

In [3]:
store_list = [['Nokia', 30000], ['Samsung', 42000], ['OnePlus', 55000], ['Apple', 92000]]
df_list = pd.DataFrame(store_list, columns=['Store', 'Sales'])
print(df_list)

     Store  Sales
0    Nokia  30000
1  Samsung  42000
2  OnePlus  55000
3    Apple  92000

In [4]:
store_data = {'Product': ['Coffee', 'Biscuits', 'Milk', 'Tea'], 'Sales':[5000,3000,2000,4000]}
df_dict = pd.DataFrame(store_data)
print(df_dict)

    Product  Sales
0    Coffee   5000
1  Biscuits   3000
2      Milk   2000
3       Tea   4000

In [5]:
store_data = {'Product': ['Coffee', 'Biscuits', 'Milk', 'Tea'], 'Sales':[5000,3000,2000,4000]}
df_dictOfList = pd.DataFrame(store_data, index=['A', 'B', 'C', 'D'])
print(df_dictOfList)

    Product  Sales
A    Coffee   5000
B  Biscuits   3000
C      Milk   2000
D       Tea   4000

In [6]:
store_data = [{'Store-A':1010, 'Store-B':210}, {'Store-A':3105, 'Store-B':4110, 'Store-C':2120}]
df_store = pd.DataFrame(store_data)
print(df_store)

   Store-A  Store-B  Store-C
0     1010      210      NaN
1     3105     4110   2120.0

In [7]:
print(type(df))
print(type(df_store['Store-A']))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [8]:
df_sales = pd.read_csv("bigmarket.csv")
print(df_sales)

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24577
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961

In [9]:
# print(df_sales.head())
# print(df_sales.tail())
print(df_sales.shape)
print(df_sales.dtypes)
print(df_sales.info())

(11, 3)
Month    object
Store    object
Sales     int64
dtype: object
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11 entries, 0 to 10
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Month   11 non-null     object
 1   Store   11 non-null     object
 2   Sales   11 non-null     int64
dtypes: int64(1), object(2)
memory usage: 392.0+ bytes
None

In [10]:
# print(df_sales.iloc[1])
# print(df_sales.iloc[0]['Store'])
# print(df_sales.iloc[3:6])
# print(df_sales.iloc[:, :2])
print(df_sales.iloc[:, [0,2]])

    Month  Sales
0     Jan  31037
1     Jan  20722
2     Jan  24577
3     Jan  34649
4     Jan  29795
5     Feb  29133
6     Feb  22695
7     Feb  28312
8     Feb  31454
9     Feb  46267
10  March  32961

In [11]:
# print(df_sales.loc[1]['Sales'])
print(df_sales.loc[0:2, ['Store','Sales']])

  Store  Sales
0     A  31037
1     B  20722
2     C  24577

In [12]:
print(df_sales[df_sales.Sales>40000])
print(df_sales[df_sales.Sales<25000])

  Month Store  Sales
9   Feb     E  46267
  Month Store  Sales
1   Jan     B  20722
2   Jan     C  24577
6   Feb     B  22695

In [13]:
print(df_sales[(df_sales.Month=='Jan') & (df_sales.Sales>30000)])

  Month Store  Sales
0   Jan     A  31037
3   Jan     D  34649

In [14]:
# print(df_sales.sort_values('Sales'))
# print(df_sales.sort_values('Sales', ascending=False))
print(df_sales.sort_values(['Store', 'Sales']))

    Month Store  Sales
5     Feb     A  29133
0     Jan     A  31037
10  March     A  32961
1     Jan     B  20722
6     Feb     B  22695
2     Jan     C  24577
7     Feb     C  28312
8     Feb     D  31454
3     Jan     D  34649
4     Jan     E  29795
9     Feb     E  46267

In [15]:
print(df_sales[df_sales.Sales>30000].sort_index())

    Month Store  Sales
0     Jan     A  31037
3     Jan     D  34649
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961

In [16]:
data = {'Name': ['Diana', 'James', 'Mia', 'Emily', 'Ruben', 'John', 'Jordan'],
        'Verbal_Score': [151,152,151,156,100,145,155],
        'Quantitative_Score': [158,87,100,146,139,129,122],
        'Qualify': ['Yes', 'No', 'No', 'Yes', 'No', 'Yes', 'Yes']}
df_score = pd.DataFrame(data)
print(df_score)

     Name  Verbal_Score  Quantitative_Score Qualify
0   Diana           151                 158     Yes
1   James           152                  87      No
2     Mia           151                 100      No
3   Emily           156                 146     Yes
4   Ruben           100                 139      No
5    John           145                 129     Yes
6  Jordan           155                 122     Yes

In [17]:
# df_score['Verbal_Rank'] = df_score.Verbal_Score.rank() #by default the method is 'average'
# df_score['Verbal_Rank'] = df_score.Verbal_Score.rank(method='min')
# df_score['Verbal_Rank'] = df_score.Verbal_Score.rank(method='max')
df_score['Verbal_Rank'] = df_score.Verbal_Score.rank(method='dense')
print(df_score)

     Name  Verbal_Score  Quantitative_Score Qualify  Verbal_Rank
0   Diana           151                 158     Yes          3.0
1   James           152                  87      No          4.0
2     Mia           151                 100      No          3.0
3   Emily           156                 146     Yes          6.0
4   Ruben           100                 139      No          1.0
5    John           145                 129     Yes          2.0
6  Jordan           155                 122     Yes          5.0

In [18]:
df_sales1 = pd.read_excel('sales-transactions.xlsx', sheet_name='Sheet0')
df_sales2 = pd.read_excel('sales-transactions.xlsx', sheet_name='Sheet1')
print(df_sales1)
print(df_sales2)

   account      name  order       sku  quantity  unit price  ext price
0   383081  Isabella  10002  C1-20000         9       43.69     393.21
1   412291    Olivia  10004  A1-06532        56       67.82    3797.92
2   412291    Olivia  10004  A1-82801        31      145.62    4514.22
3   412291    Olivia  10004  A1-06532         6       34.55     207.30
4   218896    Sophia  10007  A1-27722        35       67.46    2361.10
5   218896    Sophia  10007  C1-33087        33       26.55     876.15
6   218896    Sophia  10007  C1-33364         8       67.30     538.40
7   218896    Sophia  10007  C1-20000        -1       67.18     -67.18
   account           name  order       sku  quantity  unit price  ext price
0   383080       Will LLC  10001  B1-20000         7       33.69     235.83
1   383080       Will LLC  10001  B1-86481         3       35.99     107.97
2   412290  Jerde-Hilpert  10005  S1-06532        48       55.82    2679.36
3   412290  Jerde-Hilpert  10005  S1-47412        44       78.91    3472.04
4   412290  Jerde-Hilpert  10005  S1-27722        36       25.42     915.12
5   218895      Kulas Inc  10006  S1-27722        32       95.66    3061.12
6   218895      Kulas Inc  10006  B1-33087        23       22.55     518.65
7   218895      Kulas Inc  10006  B1-20000        -1       72.18     -72.18

In [19]:
# df_sales = pd.concat([df_sales1, df_sales2])
df_sales_3 = pd.concat([df_sales1, df_sales2], ignore_index=True)
print(df_sales_3)

    account           name  order       sku  quantity  unit price  ext price
0    383081       Isabella  10002  C1-20000         9       43.69     393.21
1    412291         Olivia  10004  A1-06532        56       67.82    3797.92
2    412291         Olivia  10004  A1-82801        31      145.62    4514.22
3    412291         Olivia  10004  A1-06532         6       34.55     207.30
4    218896         Sophia  10007  A1-27722        35       67.46    2361.10
5    218896         Sophia  10007  C1-33087        33       26.55     876.15
6    218896         Sophia  10007  C1-33364         8       67.30     538.40
7    218896         Sophia  10007  C1-20000        -1       67.18     -67.18
8    383080       Will LLC  10001  B1-20000         7       33.69     235.83
9    383080       Will LLC  10001  B1-86481         3       35.99     107.97
10   412290  Jerde-Hilpert  10005  S1-06532        48       55.82    2679.36
11   412290  Jerde-Hilpert  10005  S1-47412        44       78.91    3472.04
12   412290  Jerde-Hilpert  10005  S1-27722        36       25.42     915.12
13   218895      Kulas Inc  10006  S1-27722        32       95.66    3061.12
14   218895      Kulas Inc  10006  B1-33087        23       22.55     518.65
15   218895      Kulas Inc  10006  B1-20000        -1       72.18     -72.18

In [20]:
df_order1 = pd.read_excel('orders.xlsx', sheet_name='Sheet0')
df_order2 = pd.read_excel('orders.xlsx', sheet_name='Sheet1')
print(df_order1)
print(df_order2)

   account           name  order       sku  quantity  unit price
0   383080       Will LLC  10001  B1-20000         7       33.69
1   383080       Will LLC  10001  B1-86481         3       35.99
2   412290  Jerde-Hilpert  10005  S1-06532        48       55.82
3   412290  Jerde-Hilpert  10005  S1-47412        44       78.91
4   412290  Jerde-Hilpert  10005  S1-27722        36       25.42
5   218895      Kulas Inc  10006  S1-27722        32       95.66
6   218895      Kulas Inc  10006  B1-33087        23       22.55
7   218895      Kulas Inc  10006  B1-20000        -1       72.18
   account  ext price  ordertotal
0   383080     235.83         576
1   383080     107.97         567
2   412290    2679.36        8185
3   412290    3472.04        8285
4   412290     915.12        8385
5   218895    3061.12         915
6   218895     518.65         892
7   218895     -72.18         567

In [21]:
df_orders = pd.concat([df_order1, df_order2], axis=1)
print(df_orders)

   account           name  order       sku  quantity  unit price  account  ext price  ordertotal
0   383080       Will LLC  10001  B1-20000         7       33.69   383080     235.83         576
1   383080       Will LLC  10001  B1-86481         3       35.99   383080     107.97         567
2   412290  Jerde-Hilpert  10005  S1-06532        48       55.82   412290    2679.36        8185
3   412290  Jerde-Hilpert  10005  S1-47412        44       78.91   412290    3472.04        8285
4   412290  Jerde-Hilpert  10005  S1-27722        36       25.42   412290     915.12        8385
5   218895      Kulas Inc  10006  S1-27722        32       95.66   218895    3061.12         915
6   218895      Kulas Inc  10006  B1-33087        23       22.55   218895     518.65         892
7   218895      Kulas Inc  10006  B1-20000        -1       72.18   218895     -72.18         567

In [22]:
df = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'], 'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})
other = pd.DataFrame({'key': ['K0', 'K1', 'K2'], 'B': ['B0', 'B1', 'B2']})
joined_df = df.join(other, lsuffix='leftdf', rsuffix='rightdf')
print(joined_df)

  keyleftdf   A keyrightdf    B
0        K0  A0         K0   B0
1        K1  A1         K1   B1
2        K2  A2         K2   B2
3        K3  A3        NaN  NaN
4        K4  A4        NaN  NaN
5        K5  A5        NaN  NaN

In [23]:
order1 = pd.DataFrame({'Cust_ID':[101,102,103,104],'Name':['Olivia','Will LLC','Sophia','Isabella']})
order2 = pd.DataFrame({'Order_ID':[222,223,224,225], 'Cust_ID':[101,102,103,104],'Order':[789,465,675,564]})
print(order1.set_index('Cust_ID').join(order2.set_index('Cust_ID'), on='Cust_ID', how='inner'))

             Name  Order_ID  Order
Cust_ID
101        Olivia       222    789
102      Will LLC       223    465
103        Sophia       224    675
104      Isabella       225    564

In [24]:
print(order1.join(order2, lsuffix='-customer', rsuffix='-order'))

   Cust_ID-customer      Name  Order_ID  Cust_ID-order  Order
0               101    Olivia       222            101    789
1               102  Will LLC       223            102    465
2               103    Sophia       224            103    675
3               104  Isabella       225            104    564

In [25]:
df_cust = pd.read_excel('Ecommerce_data.xlsx', sheet_name='Cust_Data')
df_order = pd.read_excel('Ecommerce_data.xlsx', sheet_name='Order_Data')

In [26]:
print(pd.merge(df_cust, df_order, on='Cust_Id'))

  Cust_Id  Age  Gender     City  Ord_Id  Ord_Quantity    Sales Ord_Priority
0  Cust_1   35    Male   Mumbai  Ord_10           4.0  3237.00       Medium
1  Cust_2   24  Female  Chennai  Ord_14           NaN      NaN          NaN
2  Cust_3   40  Female    Delhi  Ord_25           2.0   422.70          Low
3  Cust_4   45    Male  Chennai  Ord_29          15.0  4571.79         High
4  Cust_5   37    Male   Mumbai  Ord_34           8.0  4233.15          Low
5  Cust_6   40  Female   Mumbai  Ord_52           3.0   164.02         High

In [27]:
# print(pd.merge(df_cust, df_order, on='Cust_Id', how='outer'))
# print(pd.merge(df_cust,df_order,on='Cust_Id',how='right'))
print(pd.merge(df_cust,df_order,on='Cust_Id',how='left'))

  Cust_Id  Age  Gender     City  Ord_Id  Ord_Quantity    Sales Ord_Priority
0  Cust_1   35    Male   Mumbai  Ord_10           4.0  3237.00       Medium
1  Cust_2   24  Female  Chennai  Ord_14           NaN      NaN          NaN
2  Cust_3   40  Female    Delhi  Ord_25           2.0   422.70          Low
3  Cust_4   45    Male  Chennai  Ord_29          15.0  4571.79         High
4  Cust_5   37    Male   Mumbai  Ord_34           8.0  4233.15          Low
5  Cust_6   40  Female   Mumbai  Ord_52           3.0   164.02         High

In [28]:
print(pd.merge(df_cust, df_order, left_index=True, right_index=True))

  Cust_Id_x  Age  Gender     City  Ord_Id Cust_Id_y  Ord_Quantity    Sales Ord_Priority
0    Cust_1   35    Male   Mumbai  Ord_10    Cust_1           4.0  3237.00       Medium
1    Cust_2   24  Female  Chennai  Ord_14    Cust_2           NaN      NaN          NaN
2    Cust_3   40  Female    Delhi  Ord_25    Cust_3           2.0   422.70          Low
3    Cust_4   45    Male  Chennai  Ord_29    Cust_4          15.0  4571.79         High
4    Cust_5   37    Male   Mumbai  Ord_34    Cust_5           8.0  4233.15          Low
5    Cust_6   40  Female   Mumbai  Ord_52    Cust_6           3.0   164.02         High

In [29]:
df_emp = pd.DataFrame({'Name': ['Dima', 'James', 'Mia', 'Emity', 'Roben', 'John', 'Jordan'],
                'Salary': [50000, 45000, 51000, 60000, 41000, 21450, 34000],
                'Gender': ['F', 'M', 'F', 'F', 'M', 'M', 'M'],
                'Age': [23, 34, 36, 29, 28, 25, 30]})
print(df_emp)

     Name  Salary Gender  Age
0    Dima   50000      F   23
1   James   45000      M   34
2     Mia   51000      F   36
3   Emity   60000      F   29
4   Roben   41000      M   28
5    John   21450      M   25
6  Jordan   34000      M   30

In [30]:
df_melt = df_emp.melt(id_vars=['Gender'])
# df_melt = df_emp.melt(id_vars=['Gender'], value_vars='Age')
print(df_melt)

   Gender variable   value
0       F     Name    Dima
1       M     Name   James
2       F     Name     Mia
3       F     Name   Emity
4       M     Name   Roben
5       M     Name    John
6       M     Name  Jordan
7       F   Salary   50000
8       M   Salary   45000
9       F   Salary   51000
10      F   Salary   60000
11      M   Salary   41000
12      M   Salary   21450
13      M   Salary   34000
14      F      Age      23
15      M      Age      34
16      F      Age      36
17      F      Age      29
18      M      Age      28
19      M      Age      25
20      M      Age      30

In [31]:
print(df_sales)

    Month Store  Sales
0     Jan     A  31037
1     Jan     B  20722
2     Jan     C  24577
3     Jan     D  34649
4     Jan     E  29795
5     Feb     A  29133
6     Feb     B  22695
7     Feb     C  28312
8     Feb     D  31454
9     Feb     E  46267
10  March     A  32961

In [32]:
# print(pd.pivot_table(df_sales, index='Month', values='Sales', aggfunc='sum'))
print(pd.pivot_table(df_sales, index='Store', values='Sales', columns='Month', aggfunc='sum'))

Month      Feb      Jan    March
Store
A      29133.0  31037.0  32961.0
B      22695.0  20722.0      NaN
C      28312.0  24577.0      NaN
D      31454.0  34649.0      NaN
E      46267.0  29795.0      NaN

In [33]:
df_cars = pd.DataFrame({'Car': ['BMW', 'Ford', 'Honda', 'Volvo', 'BMW', 'Ford', 'BMW'],
                        'Sales': [50000, 45000, 51000, 60000, 41000, 21450, 34000],
                        'Color': ['Black', 'Blue', 'Blue', 'Black', 'Blue' , 'Black', 'Blue']
})
print(df_cars)

     Car  Sales  Color
0    BMW  50000  Black
1   Ford  45000   Blue
2  Honda  51000   Blue
3  Volvo  60000  Black
4    BMW  41000   Blue
5   Ford  21450  Black
6    BMW  34000   Blue

In [34]:
# print(pd.crosstab(df_cars.Car, df_cars.Color, rownames=['Car'], colnames=['Color']))
print(pd.crosstab(df_cars.Car, df_cars.Color, rownames=['Car'], colnames=['Color'], values=df_cars.Sales, aggfunc='mean'))

Color    Black     Blue
Car
BMW    50000.0  37500.0
Ford   21450.0  45000.0
Honda      NaN  51000.0
Volvo  60000.0      NaN

In [48]:
my_data = pd.DataFrame(pd.read_csv('duplicates.csv', header=0))
print(my_data)

   Id     Name  Age  Gender        City
0   1  Dakshay   21    Male         NaN
1   2   Chitra   22  Female         NaN
2   3  Anubhav   20    Male      Mohali
3   4     Urja   21  Female  Chandigarh
4   1  Dakshay   21    Male         NaN
5   2   Chitra   22  Female         NaN
6   6  Dakshay   16    Male         NaN
7   7   Chitra   17  Female         NaN

In [36]:
print(my_data.duplicated(keep=False))

0     True
1     True
2    False
3    False
4     True
5     True
6    False
7    False
dtype: bool

In [37]:
print(my_data[my_data.duplicated(keep='first')])

   Id     Name  Age  Gender City
4   1  Dakshay   21    Male  NaN
5   2   Chitra   22  Female  NaN

In [38]:
# print(my_data[my_data.duplicated(['Age'],keep='first')])
# print(my_data[my_data.duplicated(['Name'],keep=False)].sort_values('Name'))
print(my_data[my_data.duplicated(['Id','Name'],keep=False)].sort_values('Name'))

   Id     Name  Age  Gender City
1   2   Chitra   22  Female  NaN
5   2   Chitra   22  Female  NaN
0   1  Dakshay   21    Male  NaN
4   1  Dakshay   21    Male  NaN

In [39]:
my_data_dup = my_data.drop_duplicates()
print(my_data_dup)

   Id     Name  Age  Gender        City
0   1  Dakshay   21    Male         NaN
1   2   Chitra   22  Female         NaN
2   3  Anubhav   20    Male      Mohali
3   4     Urja   21  Female  Chandigarh
6   6  Dakshay   16    Male         NaN
7   7   Chitra   17  Female         NaN

In [40]:
my_data_dup_col = my_data_dup[my_data_dup.duplicated(['Name'], keep=False)]
print(my_data_dup_col)

   Id     Name  Age  Gender City
0   1  Dakshay   21    Male  NaN
1   2   Chitra   22  Female  NaN
6   6  Dakshay   16    Male  NaN
7   7   Chitra   17  Female  NaN

In [41]:
my_data_drop_col = my_data_dup_col.drop_duplicates(subset=["Name"], keep='first')
print(my_data_drop_col)

   Id     Name  Age  Gender City
0   1  Dakshay   21    Male  NaN
1   2   Chitra   22  Female  NaN

In [42]:
print(my_data.drop(index=0))

   Id     Name  Age  Gender        City
1   2   Chitra   22  Female         NaN
2   3  Anubhav   20    Male      Mohali
3   4     Urja   21  Female  Chandigarh
4   1  Dakshay   21    Male         NaN
5   2   Chitra   22  Female         NaN
6   6  Dakshay   16    Male         NaN
7   7   Chitra   17  Female         NaN

In [43]:
print(my_data.drop('Age', axis=1))

   Id     Name  Gender        City
0   1  Dakshay    Male         NaN
1   2   Chitra  Female         NaN
2   3  Anubhav    Male      Mohali
3   4     Urja  Female  Chandigarh
4   1  Dakshay    Male         NaN
5   2   Chitra  Female         NaN
6   6  Dakshay    Male         NaN
7   7   Chitra  Female         NaN

In [45]:
my_data = my_data.replace(to_replace='Anubhav', value='Unknown')
print(my_data)

   Id     Name  Age  Gender        City
0   1  Dakshay   21    Male         NaN
1   2   Chitra   22  Female         NaN
2   3  Unknown   20    Male      Mohali
3   4     Urja   21  Female  Chandigarh
4   1  Dakshay   21    Male         NaN
5   2   Chitra   22  Female         NaN
6   6  Dakshay   16    Male         NaN
7   7   Chitra   17  Female         NaN

In [47]:
my_data = my_data.replace(to_replace=['Urja', 'Anubhav'], value=['-','?'])
# my_data['Name'] = my_data['Name'].replace(to_replace=['Urja', 'Anubhav'], value=['-','?'])
print(my_data)

   Id     Name  Age  Gender        City
0   1  Dakshay   21    Male         NaN
1   2   Chitra   22  Female         NaN
2   3        ?   20    Male      Mohali
3   4        -   21  Female  Chandigarh
4   1  Dakshay   21    Male         NaN
5   2   Chitra   22  Female         NaN
6   6  Dakshay   16    Male         NaN
7   7   Chitra   17  Female         NaN

In [49]:
my_data.loc[my_data['Age'] > 21, "is_old"] = "Yes"
my_data.loc[my_data['Age'] <= 21, "is_old"] = "No"
print(my_data)

   Id     Name  Age  Gender        City is_old
0   1  Dakshay   21    Male         NaN     No
1   2   Chitra   22  Female         NaN    Yes
2   3  Anubhav   20    Male      Mohali     No
3   4     Urja   21  Female  Chandigarh     No
4   1  Dakshay   21    Male         NaN     No
5   2   Chitra   22  Female         NaN    Yes
6   6  Dakshay   16    Male         NaN     No
7   7   Chitra   17  Female         NaN     No

In [50]:
my_data['is_young'] = ''
my_data['is_young'] = np.where((my_data['Age']<=21), "Yes", "No")
print(my_data)

   Id     Name  Age  Gender        City is_old is_young
0   1  Dakshay   21    Male         NaN     No      Yes
1   2   Chitra   22  Female         NaN    Yes       No
2   3  Anubhav   20    Male      Mohali     No      Yes
3   4     Urja   21  Female  Chandigarh     No      Yes
4   1  Dakshay   21    Male         NaN     No      Yes
5   2   Chitra   22  Female         NaN    Yes       No
6   6  Dakshay   16    Male         NaN     No      Yes
7   7   Chitra   17  Female         NaN     No      Yes

In [51]:
# name_grp = my_data.groupby(['Name', 'Age'])
name_grp = my_data.groupby('Name')
print(type(name_grp))
for name, name_df in name_grp:
    print(name)
    print(name_df)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
Anubhav
   Id     Name  Age Gender    City is_old is_young
2   3  Anubhav   20   Male  Mohali     No      Yes
Chitra
   Id    Name  Age  Gender City is_old is_young
1   2  Chitra   22  Female  NaN    Yes       No
5   2  Chitra   22  Female  NaN    Yes       No
7   7  Chitra   17  Female  NaN     No      Yes
Dakshay
   Id     Name  Age Gender City is_old is_young
0   1  Dakshay   21   Male  NaN     No      Yes
4   1  Dakshay   21   Male  NaN     No      Yes
6   6  Dakshay   16   Male  NaN     No      Yes
Urja
   Id  Name  Age  Gender        City is_old is_young
3   4  Urja   21  Female  Chandigarh     No      Yes

In [52]:
Dakshay_df = name_grp.get_group('Dakshay')
print(Dakshay_df)

   Id     Name  Age Gender City is_old is_young
0   1  Dakshay   21   Male  NaN     No      Yes
4   1  Dakshay   21   Male  NaN     No      Yes
6   6  Dakshay   16   Male  NaN     No      Yes

In [53]:
print(name_grp.min())
# print(name_grp.max())
# print(name_grp.mean())

         Id  Age  Gender        City is_old is_young
Name
Anubhav   3   20    Male      Mohali     No      Yes
Chitra    2   17  Female         NaN     No       No
Dakshay   1   16    Male         NaN     No      Yes
Urja      4   21  Female  Chandigarh     No      Yes

In [54]:
print(my_data.groupby(by='Name')['Age'].sum())

Name
Anubhav    20
Chitra     61
Dakshay    58
Urja       21
Name: Age, dtype: int64

In [55]:
print(my_data.groupby(by='Name').agg({'Age':['min','max']}))

        Age
        min max
Name
Anubhav  20  20
Chitra   17  22
Dakshay  16  21
Urja     21  21

In [56]:
print(my_data.isnull().sum())

Id          0
Name        0
Age         0
Gender      0
City        6
is_old      0
is_young    0
dtype: int64

In [58]:
print(my_data.columns[my_data.isnull().any()])
# print(my_data.columns[my_data.isnull().sum()>0])

Index(['City'], dtype='object')

In [59]:
my_data['City'].fillna('India', inplace=True)
print(my_data)

   Id     Name  Age  Gender        City is_old is_young
0   1  Dakshay   21    Male       India     No      Yes
1   2   Chitra   22  Female       India    Yes       No
2   3  Anubhav   20    Male      Mohali     No      Yes
3   4     Urja   21  Female  Chandigarh     No      Yes
4   1  Dakshay   21    Male       India     No      Yes
5   2   Chitra   22  Female       India    Yes       No
6   6  Dakshay   16    Male       India     No      Yes
7   7   Chitra   17  Female       India     No      Yes